In [ ]:
-- Departments Table
CREATE TABLE departments (
    department_id SERIAL PRIMARY KEY,
    department_name VARCHAR(100) NOT NULL
);

-- Employees Table
CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    employee_name VARCHAR(100) NOT NULL,
    department_id INTEGER REFERENCES departments(department_id),
    salary DECIMAL(10, 2) NOT NULL,
    hire_date DATE
);

-- Products Table
CREATE TABLE products (
    product_id SERIAL PRIMARY KEY,
    product_name VARCHAR(100) NOT NULL,
    category_id INTEGER,
    price DECIMAL(10, 2) NOT NULL,
    stock_quantity INTEGER NOT NULL
);

-- Categories Table
CREATE TABLE categories (
    category_id SERIAL PRIMARY KEY,
    category_name VARCHAR(100) NOT NULL
);

-- Orders Table
CREATE TABLE orders (
    order_id SERIAL PRIMARY KEY,
    customer_id INTEGER NOT NULL,
    order_date DATE NOT NULL
);

-- Customers Table
CREATE TABLE customers (
    customer_id SERIAL PRIMARY KEY,
    customer_name VARCHAR(100) NOT NULL,
    city VARCHAR(100)
);

In [ ]:
-- Departments
INSERT INTO departments (department_name) VALUES
('Sales'), ('Marketing'), ('Engineering'), ('HR');

-- Categories
INSERT INTO categories (category_name) VALUES
('Electronics'), ('Clothing'), ('Books');

-- Employees
INSERT INTO employees (employee_name, department_id, salary, hire_date) VALUES
('Alice Smith', 1, 60000.00, '2022-01-15'),
('Bob Johnson', 1, 75000.00, '2021-08-20'),
('Charlie Brown', 2, 55000.00, '2023-03-10'),
('Diana Davis', 3, 90000.00, '2020-11-01'),
('Eve Williams', 3, 80000.00, '2022-05-05'),
('Frank Miller', 4, 65000.00, '2022-09-12');

-- Products
INSERT INTO products (product_name, category_id, price, stock_quantity) VALUES
('Laptop', 1, 1200.00, 50),
('T-Shirt', 2, 25.00, 200),
('Database Design', 3, 40.00, 100),
('Smartphone', 1, 800.00, 75),
('Jeans', 2, 60.00, 150);

-- Customers
INSERT INTO customers (customer_name, city) VALUES
('John Doe', 'New York'),
('Jane Smith', 'London'),
('Peter Jones', 'Paris');

-- Orders
INSERT INTO orders (customer_id, order_date) VALUES
(1, '2023-02-10'),
(2, '2023-03-15'),
(1, '2023-04-22');

In [ ]:
SELECT employee_name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

In [ ]:
SELECT *
FROM products
WHERE (category_id, price) IN (SELECT category_id, MAX(price) FROM products GROUP BY category_id);

In [ ]:
SELECT customer_name
FROM customers
WHERE customer_id IN (SELECT customer_id FROM orders WHERE order_date > '2023-03-01');

In [ ]:
SELECT dept_name, AVG(salary) AS avg_salary
FROM (SELECT d.department_name AS dept_name, e.salary
      FROM employees e
      JOIN departments d ON e.department_id = d.department_id) AS emp_dept  -- Table subquery aliased as emp_dept
GROUP BY dept_name
ORDER BY avg_salary DESC;

In [ ]:
SELECT employee_name
FROM employees e1
WHERE salary > (SELECT AVG(salary) FROM employees e2 WHERE e1.department_id = e2.department_id);

In [ ]:
SELECT c.customer_name
FROM customers c
WHERE EXISTS (SELECT 1 FROM orders o WHERE o.customer_id = c.customer_id AND o.order_date > '2023-03-01');

In [ ]:
SELECT d.department_name
FROM departments d
WHERE NOT EXISTS (SELECT 1 FROM employees e WHERE e.department_id = d.department_id);

In [ ]:
SELECT department_id, AVG(salary) AS avg_salary
FROM employees
GROUP BY department_id
HAVING AVG(salary) > (SELECT AVG(salary) FROM employees);

In [ ]:
UPDATE products
SET price = price * 1.10
WHERE category_id IN (SELECT category_id FROM categories WHERE category_name = 'Electronics');

In [ ]:
INSERT INTO customers (customer_name, city)
SELECT employee_name, 'Unknown'
FROM employees
WHERE department_id = (SELECT department_id FROM departments WHERE department_name = 'HR');